uhnp/src/Catalogs/КлючиКонтроляБюджетныхЛимитовРезервов/КлючиКонтроляБюджетныхЛимитовРезервов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиКонтроляБюджетныхЛимитовРезервов</name>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаПланированияСтатейБюджетов</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаПланированияСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРезервирования</name>
    <type>
      <types>DefinedType.ОбъектыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаКонтроля</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьКонтроля</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПериодЛимитирования</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/АналитикаКонтроляБюджетныхЛимитовРезервов/АналитикаКонтроляБюджетныхЛимитовРезервов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналитикаКонтроляБюджетныхЛимитовРезервов</name>
  <resources>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиКонтроляБюджетныхЛимитовРезервов</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПланированияСтатейБюджетов</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтатейБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПланированияСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРезервирования</name>
    <type>
      <types>DefinedType.ОбъектыПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоПериодаКонтроля</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодичностьКонтроля</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/КлючиКонтроляБюджетныхЛимитовРезервов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ЗаменаДублейКлючейАналитики

Процедура ЗаменитьДублиКлючейАналитики() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка,
	|	ДанныеСправочника.ПометкаУдаления КАК ПометкаУдаления,
	|	Аналитика.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	Справочник.КлючиКонтроляБюджетныхЛимитовРезервов КАК ДанныеСправочника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаКонтроляБюджетныхЛимитовРезервов КАК ДанныеРегистра
	|		ПО ДанныеСправочника.Ссылка = ДанныеРегистра.КлючАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаКонтроляБюджетныхЛимитовРезервов КАК Аналитика
	|		ПО ДанныеСправочника.ВидБюджета = Аналитика.ВидБюджета
	|			И ДанныеСправочника.АналитикаПланированияСтатейБюджетов = Аналитика.АналитикаПланированияСтатейБюджетов
	|			И ДанныеСправочника.АналитикаПланированияСтруктуры = Аналитика.АналитикаПланированияСтруктуры
	|			И ДанныеСправочника.ДокументРезервирования = Аналитика.ДокументРезервирования
	|			И ДанныеСправочника.НачалоПериодаКонтроля = Аналитика.НачалоПериодаКонтроля
	|			И ДанныеСправочника.ПериодичностьКонтроля = Аналитика.ПериодичностьКонтроля
	|ГДЕ
	|	ДанныеРегистра.КлючАналитики ЕСТЬ NULL";
	
	// Сформируем соответствие ключей аналитики.
	СоответствиеАналитик = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СоответствиеАналитик.Вставить(Выборка.Ссылка, Выборка.КлючАналитики);
			
			Если Не Выборка.ПометкаУдаления Тогда
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Попытка
					СправочникОбъект.УстановитьПометкуУдаления(Истина, Ложь);
				Исключение
					ВызватьИсключение;
				КонецПопытки;
			КонецЕсли;

		КонецЦикла;
		Исключения = Новый Массив;
		ОбщегоНазначенияОПК.ЗаменитьСсылки(СоответствиеАналитик);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
